# Add/Remove Rows and Columns From DataFrames

In [2]:
import pandas as pd
people={
    "First" :["Siddhant","Rupaniwta","Karan"],
    "Last" :["Roy","Sahani","Yadav"],
    "Email":["siddhantroy@gmail.com","rupaniwtasahani@gmail.com","karanyadaav@gmail.com"],
    "Age" :[18,13,19]
}
df=pd.DataFrame(people)
df

       First    Last                      Email  Age
0   Siddhant     Roy      siddhantroy@gmail.com   18
1  Rupaniwta  Sahani  rupaniwtasahani@gmail.com   13
2      Karan   Yadav      karanyadaav@gmail.com   19

Adding a column:

In [3]:
# to create a new column for the full name we can do this:

df["Full_Name"] = df["First"]+" "+df["Last"]
df

       First    Last                      Email  Age         Full_Name
0   Siddhant     Roy      siddhantroy@gmail.com   18      Siddhant Roy
1  Rupaniwta  Sahani  rupaniwtasahani@gmail.com   13  Rupaniwta Sahani
2      Karan   Yadav      karanyadaav@gmail.com   19       Karan Yadav

Deleting a column :

In [4]:
#let's delete the first and last named column as we no longer need it :
# to delete a single column we can just pass the name of it but if we want to delete multiplle columns we can pass it inside of a list
#df.drop(columns="First") to delete a single column :
df.drop(columns=["First","Last"],inplace=True)
df

                       Email  Age         Full_Name
0      siddhantroy@gmail.com   18      Siddhant Roy
1  rupaniwtasahani@gmail.com   13  Rupaniwta Sahani
2      karanyadaav@gmail.com   19       Karan Yadav

In [5]:
#expand=True is used to convert the list into a dataframe so it can further be assigned to new columns
df["Full_Name"].str.split(" ",expand=True)

           0       1
0   Siddhant     Roy
1  Rupaniwta  Sahani
2      Karan   Yadav

In [6]:
df[["First","Last"]]=df["Full_Name"].str.split(" ",expand=True)
df

#we can see that new columns name First and Last is being created from the expaned list earlier

                       Email  Age         Full_Name      First    Last
0      siddhantroy@gmail.com   18      Siddhant Roy   Siddhant     Roy
1  rupaniwtasahani@gmail.com   13  Rupaniwta Sahani  Rupaniwta  Sahani
2      karanyadaav@gmail.com   19       Karan Yadav      Karan   Yadav

To add a single row of values or to add another dataframe to an existing dataframe we can use .concat() method:

In [4]:
#our existing dataframe
df

       First    Last                      Email  Age
0   Siddhant     Roy      siddhantroy@gmail.com   18
1  Rupaniwta  Sahani  rupaniwtasahani@gmail.com   13
2      Karan   Yadav      karanyadaav@gmail.com   19

In [5]:
# we make a new dataframe :
people2={
    "First" :["Adi","Simran"],
    "Last" :["Sharma","Roy"],
    "Email":["adisharma@gmail.com","simranroy@gmail.com"],
    "Age" :[18,19]
}
new_df=pd.DataFrame(people2)
new_df

    First    Last                Email  Age
0     Adi  Sharma  adisharma@gmail.com   18
1  Simran     Roy  simranroy@gmail.com   19

In [6]:
#to add the new values or add the new dataframe to the existing datframe we can use pd.concat()
result_df=pd.concat([df,new_df],ignore_index=True)
result_df

       First    Last                      Email  Age
0   Siddhant     Roy      siddhantroy@gmail.com   18
1  Rupaniwta  Sahani  rupaniwtasahani@gmail.com   13
2      Karan   Yadav      karanyadaav@gmail.com   19
3        Adi  Sharma        adisharma@gmail.com   18
4     Simran     Roy        simranroy@gmail.com   19

In [7]:
filt=result_df["Age"]==18
result_df.loc[filt,["First","Last"]]

      First    Last
0  Siddhant     Roy
3       Adi  Sharma